<!doctype html>
<html class="theme-next use-motion theme-next-mist">
<head>
  

<meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>
<meta name="baidu-site-verification" content="EYxran2Vav" />

<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />








  <link rel="stylesheet" type="text/css" href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5"/>




<link rel="stylesheet" type="text/css" href="/css/main.css?v=0.4.5.1"/>


    <meta name="description" content="相信自己做一个自信的人" />



  <meta name="keywords" content="jvm,多线程,Java内存模型" />



  <link rel="alternate" href="/atom.xml" title="I am TKing" type="application/atom+xml" />



  <link rel="shorticon icon" type="image/x-icon" href="/favicon.ico?v=0.4.5.1" />


<meta name="description" content="一篇讲解Java内存模型的文章，通俗简要说明了多线程编码所面临的问题和什么是JMM。">
<meta property="og:type" content="article">
<meta property="og:title" content="一篇文章讲懂Java内存模型">
<meta property="og:url" content="http://yoursite.com/2018/08/12/what-is-java-memory-model/index.html">
<meta property="og:site_name" content="I am TKing">
<meta property="og:description" content="一篇讲解Java内存模型的文章，通俗简要说明了多线程编码所面临的问题和什么是JMM。">
<meta property="og:image" content="http://7xlvme.com1.z0.glb.clouddn.com/thread-java-running-data-area.png">
<meta property="og:image" content="http://7xlvme.com1.z0.glb.clouddn.com/code_sort_in_jmm.jpg">
<meta property="og:image" content="http://7xlvme.com1.z0.glb.clouddn.com/jmm_for_memory.jpg">
<meta property="og:image" content="http://7xlvme.com1.z0.glb.clouddn.com/volatile_in_jmm.png">
<meta property="og:updated_time" content="2018-08-13T13:37:46.272Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="一篇文章讲懂Java内存模型">
<meta name="twitter:description" content="一篇讲解Java内存模型的文章，通俗简要说明了多线程编码所面临的问题和什么是JMM。">


<script type="text/javascript" id="hexo.configuration">
  var CONFIG = {
    scheme: 'Mist',
    sidebar: 'post'
  };
</script>
<script async src="//dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js">
</script>
  <title> 一篇文章讲懂Java内存模型 | I am TKing </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  <!--[if lte IE 8]>
  <div style=' clear: both; height: 59px; padding:0 0 0 15px; position: relative;margin:0 auto;'>
    <a href="http://windows.microsoft.com/en-US/internet-explorer/products/ie/home?ocid=ie6_countdown_bannercode">
      <img src="http://7u2nvr.com1.z0.glb.clouddn.com/picouterie.jpg" border="0" height="42" width="820"
           alt="You are using an outdated browser. For a faster, safer browsing experience, upgrade for free today or use other browser ,like chrome firefox safari."
           style='margin-left:auto;margin-right:auto;display: block;'/>
    </a>
  </div>
<![endif]-->
  



  <div class="container one-column page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><h1 class="site-meta">
  <span class="logo-line-before"><i></i></span>
  <a href="/" class="brand" rel="start">
      <span class="logo">
        <i class="icon-next-logo"></i>
      </span>
      <span class="site-title">I am TKing</span>
  </a>
  <span class="logo-line-after"><i></i></span>
</h1>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            <i class="menu-item-icon icon-next-home"></i> <br />
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            <i class="menu-item-icon icon-next-categories"></i> <br />
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            <i class="menu-item-icon icon-next-about"></i> <br />
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            <i class="menu-item-icon icon-next-archives"></i> <br />
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-commonweal">
          <a href="/404.html" rel="section">
            <i class="menu-item-icon icon-next-commonweal"></i> <br />
            公益404
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            <i class="menu-item-icon icon-next-tags"></i> <br />
            标签
          </a>
        </li>
      

      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div id="content" class="content"> 

  <div id="posts" class="posts-expand">
    

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
    <header class="post-header">

      
      
        <h1 class="post-title" itemprop="name headline">
          
          
            
              一篇文章讲懂Java内存模型
            
          
        </h1>
      

      <div class="post-meta">
        <span class="post-time">
          发表于
          <time itemprop="dateCreated" datetime="2018-08-12T20:53:42+08:00" content="2018-08-12">
            2018-08-12
          </time>
        </span>

        
          <span class="post-category" >
            &nbsp; | &nbsp; 分类于
            
              <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                <a href="/categories/jvm/" itemprop="url" rel="index">
                  <span itemprop="name">jvm</span>
                </a>
              </span>

              
              
                ， 
              

            
              <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                <a href="/categories/jvm/多线程/" itemprop="url" rel="index">
                  <span itemprop="name">多线程</span>
                </a>
              </span>

              
              

            
          </span>
        

        
          
        
        
        
           <span class="post-comments-count">
            <span id="busuanzi_container_page_pv">
              &nbsp; | &nbsp;<span id="busuanzi_value_page_pv"></span>次阅读
            </span>
          </span>
        
      </div>
    </header>

    <div class="post-body">

      
      

      
        <span itemprop="articleBody"><h3 id="java&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x533A;&#x57DF;">Java&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x533A;&#x57DF;</h3>
<p>&#x5728;Java&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#x57DF;&#x3001;&#x9759;&#x6001;&#x57DF;&#x548C;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x5728;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5806;&#x5185;&#x5B58;&#x5728;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#xFF08;&#x672C;&#x6587;&#x4F7F;&#x7528;&#x201C;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x201D;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x4EE3;&#x6307;&#x5B9E;&#x4F8B;&#x57DF;&#xFF0C;&#x9759;&#x6001;&#x57DF;&#x548C;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#xFF09;&#x3002;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF08;Local variables&#xFF09;&#xFF0C;&#x65B9;&#x6CD5;&#x5B9A;&#x4E49;&#x53C2;&#x6570;&#xFF08;Java&#x8BED;&#x8A00;&#x89C4;&#x8303;&#x79F0;&#x4E4B;&#x4E3A;formal method parameters&#xFF09;&#x548C;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5668;&#x53C2;&#x6570;&#xFF08;exception handler parameters&#xFF09;&#x4E0D;&#x4F1A;&#x5728;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x4F1A;&#x6709;&#x5185;&#x5B58;&#x53EF;&#x89C1;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x4E0D;&#x53D7;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x7684;&#x5F71;&#x54CD;
<img src="http://7xlvme.com1.z0.glb.clouddn.com/thread-java-running-data-area.png" alt="Java&#x8FD0;&#x884C;&#x65F6;&#x6570;&#x636E;&#x533A;"></p>
<h3 id="&#x591A;&#x7EBF;&#x7A0B;&#x4E0B;&#x7F16;&#x7801;&#x95EE;&#x9898;">&#x591A;&#x7EBF;&#x7A0B;&#x4E0B;&#x7F16;&#x7801;&#x95EE;&#x9898;</h3>
<p>&#x5728;Java&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x673A;&#x5236;&#x662F;&#x901A;&#x8FC7;&#x8BFB;&#x5199;&#x5171;&#x4EAB;&#x5185;&#x5B58;(&#x5806;&#x5185;&#x5B58;)&#x4E2D;&#x7684;&#x516C;&#x5171;&#x6570;&#x636E;&#x6765;&#x9690;&#x5F0F;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x7684;&#xFF0C;&#x800C;&#x540C;&#x6B65;&#x662F;&#x6307;&#x7A0B;&#x5E8F;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x64CD;&#x4F5C;&#x53D1;&#x751F;&#x76F8;&#x5BF9;&#x987A;&#x5E8F;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x540C;&#x6B65;&#x662F;&#x663E;&#x5F0F;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x7A0B;&#x5E8F;&#x5458; &#x663E;&#x5F0F;&#x6307;&#x5B9A;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x6216;&#x67D0;&#x6BB5;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x5728;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x4E92;&#x65A5;&#x6267;&#x884C;&#x3002;&#x7531;&#x4E8E;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x662F;&#x9690;&#x5F0F;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x4E86;&#x89E3;&#x8FD9;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x673A;&#x5236;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x5404;&#x79CD;&#x5947;&#x602A;&#x7684;&#x5185;&#x5B58;&#x53EF;&#x89C1;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x5BFC;&#x81F4;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7801;&#x4E2D;&#x5F97;&#x5230;&#x5F88;&#x591A;&#x4F60;&#x4E0D;&#x60F3;&#x8981;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x5728;&#x5904;&#x7406;&#x5668;&#x7EA7;&#x522B;&#xFF0C;&#x7531;&#x4E8E;&#x73B0;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x662F;&#x591A;CPU&#x7684;,&#x5B58;&#x50A8;&#x5668;&#x6A21;&#x578B;&#x4E5F;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x7528;&#x4E8E;&#x77E5;&#x9053;&#x5F53;&#x524D;&#x5904;&#x7406;&#x5668;&#x5BF9;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x5668;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x5199;&#x5165;&#x662F;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x67D0;&#x4E9B;&#x5904;&#x7406;&#x5668;&#x8868;&#x73B0;&#x51FA;&#x5F3A;&#x5927;&#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF0C;&#x5176;&#x4E2D;&#x6240;&#x6709;&#x5904;&#x7406;&#x5668;&#x59CB;&#x7EC8;&#x770B;&#x5230;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#x7684;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x5668;&#x8868;&#x73B0;&#x51FA;&#x8F83;&#x5F31;&#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF0C;&#x5176;&#x4E2D;&#x9700;&#x8981;&#x7279;&#x6B8A;&#x6307;&#x4EE4;&#xFF08;&#x79F0;&#x4E3A;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#xFF0C;memory barriers&#xFF0C;intel&#x79F0;&#x4E4B;&#x4E3A;memory fence&#xFF09;&#x6765;&#x5237;&#x65B0;&#x6216;&#x4F7F;&#x672C;&#x5730;&#x5904;&#x7406;&#x5668;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x65E0;&#x6548;&#xFF0C;&#x4EE5;&#x4FBF;&#x67E5;&#x770B;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x5668;&#x8FDB;&#x884C;&#x7684;&#x5199;&#x5165;&#x6216;&#x4F7F;&#x8BE5;&#x5904;&#x7406;&#x5668;&#x7684;&#x5199;&#x5165;&#x5BF9;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x5668;&#x53EF;&#x89C1;&#x3002;&#x4F46;&#x662F;&#x5373;&#x4F7F;&#x5728;&#x4E00;&#x4E9B;&#x6700;&#x5F3A;&#x5927;&#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x4E0A;&#xFF0C;&#x901A;&#x5E38;&#x4E5F;&#x9700;&#x8981;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x3002;&#x5904;&#x7406;&#x5668;&#x5927;&#x591A;&#x6570;&#x4F7F;&#x7528;&#x8F83;&#x5F31;&#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5BB9;&#x8BB8;&#x66F4;&#x5927;&#x7684;&#x6269;&#x5C55;&#x6027;&#x3002;</p>
<p>&#x7F16;&#x8BD1;&#x5668;&#x91CD;&#x65B0;&#x6392;&#x5E8F;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5199;&#x5165;&#x5BF9;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x89C1;&#x7684;&#x95EE;&#x9898;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x51B3;&#x5B9A;&#x7A0D;&#x540E;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x79FB;&#x52A8;&#x5199;&#x64CD;&#x4F5C;&#x66F4;&#x6709;&#x6548;;&#x53EA;&#x8981;&#x6B64;&#x4EE3;&#x7801;&#x52A8;&#x4F5C;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x7A0B;&#x5E8F;&#x7684;&#x8BED;&#x4E49;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x7F16;&#x8BD1;&#x5668;&#x63A8;&#x8FDF;&#x64CD;&#x4F5C;&#xFF0C;&#x5219;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#x5B83;;&#x8FD9;&#x53CD;&#x6620;&#x4E86;&#x7F13;&#x5B58;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x5728;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x65F6;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x5904;&#x7406;&#x5668;&#x5E38;&#x5E38;&#x4F1A;&#x5BF9;&#x6307;&#x4EE4;&#x505A;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x91CD;&#x6392;&#x5E8F;&#x5206;&#x4E09;&#x79CD;&#x7C7B;&#x578B;</p>
<ol>
<li>
<p>&#x7F16;&#x8BD1;&#x5668;&#x4F18;&#x5316;&#x7684;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x4E0D;&#x6539;&#x53D8;&#x5355;&#x7EBF;&#x7A0B;&#x7A0B;&#x5E8F;&#x8BED;&#x4E49;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x5B89;&#x6392;&#x8BED;&#x53E5;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x3002;</p>
</li>
<li>
<p>&#x6307;&#x4EE4;&#x7EA7;&#x5E76;&#x884C;&#x7684;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x73B0;&#x4EE3;&#x5904;&#x7406;&#x5668;&#x91C7;&#x7528;&#x4E86;&#x6307;&#x4EE4;&#x7EA7;&#x5E76;&#x884C;&#x6280;&#x672F;&#xFF08;Instruction-Level Parallelism&#xFF0C; ILP&#xFF09;&#x6765;&#x5C06;&#x591A;&#x6761;&#x6307;&#x4EE4;&#x91CD;&#x53E0;&#x6267;&#x884C;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x5B58;&#x5728;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x6027;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x8BED;&#x53E5;&#x5BF9;&#x5E94;&#x673A;&#x5668;&#x6307;&#x4EE4;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x3002;</p>
</li>
<li>
<p>&#x5185;&#x5B58;&#x7CFB;&#x7EDF;&#x7684;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x7531;&#x4E8E;&#x5904;&#x7406;&#x5668;&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x548C;&#x8BFB;/&#x5199;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x52A0;&#x8F7D;&#x548C;&#x5B58;&#x50A8;&#x64CD;&#x4F5C;&#x770B;&#x4E0A;&#x53BB;&#x53EF;&#x80FD;&#x662F;&#x5728;&#x4E71;&#x5E8F;&#x6267;&#x884C;&#x3002;</p>
</li>
</ol>
<p>java&#x4EE3;&#x7801;&#x5230;&#x6700;&#x7EC8;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x4F1A;&#x5206;&#x522B;&#x7ECF;&#x5386;&#x4E0B;&#x9762;&#x4E09;&#x79CD;&#x6392;&#x5E8F;
<img src="http://7xlvme.com1.z0.glb.clouddn.com/code_sort_in_jmm.jpg" alt="&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;"></p>
<h3 id="&#x4EC0;&#x4E48;&#x662F;java&#x5185;&#x5B58;&#x6A21;&#x578B;">&#x4EC0;&#x4E48;&#x662F;Java&#x5185;&#x5B58;&#x6A21;&#x578B;</h3>
<p>Java&#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x4E2D;&#x8BD5;&#x56FE;&#x5B9A;&#x4E49;&#x4E00;&#x79CD;Java&#x5185;&#x5B58;&#x6A21;&#x578B;(JMM,Java Memory Model)&#x6765;&#x5C4F;&#x853D;&#x5404;&#x79CD;&#x786C;&#x4EF6;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x5DEE;&#x5F02;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;Java&#x7A0B;&#x5E8F;&#x5728;&#x5404;&#x79CD;&#x5E73;&#x53F0;&#x4E0B;&#x90FD;&#x80FD;&#x8FBE;&#x5230;&#x4E00;&#x81F4;&#x7684;&#x8BBF;&#x95EE;&#x6548;&#x679C;&#x3002;</p>
<p>&#x4E0A;&#x8FF0;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x91CD;&#x6392;&#x5E8F;(&#x5305;&#x62EC;&#x6307;&#x4EE4;&#x96C6;&#x91CD;&#x6392;&#x5E8F;&#x548C;&#x5185;&#x5B58;&#x7CFB;&#x7EDF;&#x91CD;&#x6392;&#x5E8F;)&#x8FD9;&#x4E9B;&#x91CD;&#x6392;&#x5E8F;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x591A;&#x7EBF;&#x7A0B;&#x7A0B;&#x5E8F;&#x51FA;&#x73B0;&#x5185;&#x5B58;&#x53EF;&#x89C1;&#x6027;&#x95EE;&#x9898;&#x3002;&#x5BF9;&#x4E8E;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;JMM&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x89C4;&#x5219;&#x4F1A;&#x7981;&#x6B62;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#xFF08;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x90FD;&#x8981;&#x7981;&#x6B62;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x5904;&#x7406;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;JMM&#x7684;&#x5904;&#x7406;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x89C4;&#x5219;&#x4F1A;&#x8981;&#x6C42;java&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x751F;&#x6210;&#x6307;&#x4EE4;&#x5E8F;&#x5217;&#x65F6;&#xFF0C;&#x63D2;&#x5165;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x6307;&#x4EE4;&#xFF0C;&#x901A;&#x8FC7;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x6307;&#x4EE4;&#x6765;&#x7981;&#x6B62;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x5904;&#x7406;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#xFF08;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x5904;&#x7406;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x90FD;&#x8981;&#x7981;&#x6B62;&#xFF09;&#x3002;
JMM&#x5C5E;&#x4E8E;&#x8BED;&#x8A00;&#x7EA7;&#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x786E;&#x4FDD;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x5668;&#x5E73;&#x53F0;&#x4E4B;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;&#x7981;&#x6B62;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x548C;&#x5904;&#x7406;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x7684;&#x5185;&#x5B58;&#x53EF;&#x89C1;&#x6027;&#x4FDD;&#x8BC1;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x8FD9;&#x4E48;&#x591A;&#x95EE;&#x9898;&#x90FD;&#x5F71;&#x54CD;&#x6211;&#x4EEC;&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7801;&#xFF0C;&#x56E0;&#x6B64;Java&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x4E00;&#x6B21;&#x7F16;&#x8BD1;&#x5230;&#x5904;&#x8FD0;&#x884C;&#xFF0C;&#x8BA9;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x7531;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x63A7;&#x5236;&#xFF0C;JMM&#x51B3;&#x5B9A;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5BF9;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;&#x5199;&#x5165;&#x4F55;&#x65F6;&#x5BF9;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x89C1;&#x3002;&#x4ECE;&#x62BD;&#x8C61;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;JMM&#x5B9A;&#x4E49;&#x4E86;&#x7EBF;&#x7A0B;&#x548C;&#x4E3B;&#x5185;&#x5B58;&#x4E4B;&#x95F4;&#x7684;&#x62BD;&#x8C61;&#x5173;&#x7CFB;&#xFF1A;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x5B58;&#x50A8;&#x5728;&#x4E3B;&#x5185;&#x5B58;&#xFF08;main memory&#xFF09;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x79C1;&#x6709;&#x7684;&#x672C;&#x5730;&#x5185;&#x5B58;&#xFF08;local memory&#xFF09;&#xFF0C;&#x672C;&#x5730;&#x5185;&#x5B58;&#x4E2D;&#x5B58;&#x50A8;&#x4E86;&#x8BE5;&#x7EBF;&#x7A0B;&#x4EE5;&#x8BFB;/&#x5199;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;&#x526F;&#x672C;&#x3002;&#x672C;&#x5730;&#x5185;&#x5B58;&#x662F;JMM&#x7684;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x4E0D;&#x771F;&#x5B9E;&#x5B58;&#x5728;&#x3002;&#x5B83;&#x6DB5;&#x76D6;&#x4E86;&#x7F13;&#x5B58;&#xFF0C;&#x5199;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x7F16;&#x8BD1;&#x5668;&#x4F18;&#x5316;&#x3002;
<img src="http://7xlvme.com1.z0.glb.clouddn.com/jmm_for_memory.jpg" alt="Java&#x7EBF;&#x7A0B;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x548C;&#x4E3B;&#x5B58;&#x901A;&#x4FE1;"></p>
<h4 id="as-if-serial&#x8BED;&#x4E49;">as-if-serial&#x8BED;&#x4E49;</h4>
<p>as-if-serial&#x8BED;&#x4E49;&#x6307;&#x7684;&#x662F;&#x4E0D;&#x7BA1;&#x600E;&#x4E48;&#x91CD;&#x6392;&#x5E8F;(&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x5904;&#x7406;&#x5668;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x5E76;&#x884C;&#x5EA6;)&#xFF0C;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x4E0D;&#x80FD;&#x88AB;&#x6539;&#x53D8;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;runtime&#x548C;&#x5904;&#x7406;&#x5668;&#x90FD;&#x5FC5;&#x987B;&#x51C6;&#x5B88;as-if-serial&#x8BED;&#x4E49;&#x3002;&#x4E3A;&#x4E86;&#x9075;&#x5B88;as-if-serial&#x8BED;&#x4E49;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x5904;&#x7406;&#x5668;&#x4E0D;&#x4F1A;&#x5BF9;&#x5B58;&#x5728;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x64CD;&#x4F5C;&#x505A;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x91CD;&#x6392;&#x5E8F;&#x4F1A;&#x6539;&#x53D8;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x4E0D;&#x5B58;&#x5728;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x53EF;&#x80FD;&#x88AB;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x5904;&#x7406;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x3002;</p>
<p>&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;:</p>
<table>
<thead>
<tr>
<th>&#x540D;&#x79F0;</th>
<th>&#x4EE3;&#x7801;&#x793A;&#x4F8B;</th>
<th>&#x8BF4;&#x660E;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x5199;&#x540E;&#x8BFB;</td>
<td>a = 1;b = a;</td>
<td>&#x5199;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x8BFB;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;</td>
</tr>
<tr>
<td>&#x5199;&#x540E;&#x5199;</td>
<td>a = 1;a = 2;</td>
<td>&#x5199;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x5199;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x3002;</td>
</tr>
<tr>
<td>&#x8BFB;&#x540E;&#x5199;</td>
<td>a = b;b = 1;</td>
<td>&#x8BFB;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x5199;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;</td>
</tr>
</tbody>
</table>
<p>&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x5904;&#x7406;&#x5668;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x5B58;&#x5728;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x3002; &#x4EC5;&#x9488;&#x5BF9;&#x5355;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x5E8F;&#x5217;&#x548C;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4E0D;&#x540C;&#x5904;&#x7406;&#x5668;&#x4E4B;&#x95F4;&#x548C;&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x6027;&#x4E0D;&#x88AB;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x5904;&#x7406;&#x5668;&#x8003;&#x8651;&#x3002;</p>
<h4 id="&#x5904;&#x7406;&#x5668;&#x6392;&#x5E8F;&#x4E0E;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x6307;&#x4EE4;">&#x5904;&#x7406;&#x5668;&#x6392;&#x5E8F;&#x4E0E;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x6307;&#x4EE4;</h4>
<p>&#x73B0;&#x4EE3;&#x7684;&#x5904;&#x7406;&#x5668;&#x4F7F;&#x7528;&#x5199;&#x7F13;&#x51B2;&#x533A;&#x6765;&#x4E34;&#x65F6;&#x4FDD;&#x5B58;&#x5411;&#x5185;&#x5B58;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#x3002;&#x5199;&#x7F13;&#x51B2;&#x533A;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x6307;&#x4EE4;&#x6D41;&#x6C34;&#x7EBF;&#x6301;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7531;&#x4E8E;&#x5904;&#x7406;&#x5668;&#x505C;&#x987F;&#x4E0B;&#x6765;&#x7B49;&#x5F85;&#x5411;&#x5185;&#x5B58;&#x5199;&#x5165;&#x6570;&#x636E;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x4EE5;&#x6279;&#x5904;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#x5237;&#x65B0;&#x5199;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x4EE5;&#x53CA;&#x5408;&#x5E76;&#x5199;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x5BF9;&#x540C;&#x4E00;&#x5185;&#x5B58;&#x5730;&#x5740;&#x7684;&#x591A;&#x6B21;&#x5199;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5BF9;&#x5185;&#x5B58;&#x603B;&#x7EBF;&#x7684;&#x5360;&#x7528;&#x3002;&#x867D;&#x7136;&#x5199;&#x7F13;&#x51B2;&#x533A;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x597D;&#x5904;&#xFF0C;&#x4F46;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x7684;&#x5199;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x4EC5;&#x4EC5;&#x5BF9;&#x5B83;&#x6240;&#x5728;&#x7684;&#x5904;&#x7406;&#x5668;&#x53EF;&#x89C1;&#x3002;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x4F1A;&#x5BF9;&#x5185;&#x5B58;&#x64CD;&#x4F5C;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x4EA7;&#x751F;&#x91CD;&#x8981;&#x7684;&#x5F71;&#x54CD;&#xFF1A;&#x5904;&#x7406;&#x5668;&#x5BF9;&#x5185;&#x5B58;&#x7684;&#x8BFB;/&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x4E0E;&#x5185;&#x5B58;&#x5B9E;&#x9645;&#x53D1;&#x751F;&#x7684;&#x8BFB;/&#x5199;&#x64CD;&#x4F5C;&#x987A;&#x5E8F;&#x4E00;&#x81F4;&#xFF01;
&#x7531;&#x4E8E;&#x5199;&#x7F13;&#x51B2;&#x533A;&#x4EC5;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x5904;&#x7406;&#x5668;&#x53EF;&#x89C1;&#xFF0C;&#x5B83;&#x4F1A;&#x5BFC;&#x81F4;&#x5904;&#x7406;&#x5668;&#x6267;&#x884C;&#x5185;&#x5B58;&#x64CD;&#x4F5C;&#x7684;&#x987A;&#x5E8F;&#x53EF;&#x80FD;&#x4F1A;&#x4E0E;&#x5185;&#x5B58;&#x5B9E;&#x9645;&#x7684;&#x64CD;&#x4F5C;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x4E0D;&#x4E00;&#x81F4;&#x3002;&#x7531;&#x4E8E;&#x73B0;&#x4EE3;&#x7684;&#x5904;&#x7406;&#x5668;&#x90FD;&#x4F1A;&#x4F7F;&#x7528;&#x5199;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x56E0;&#x6B64;&#x73B0;&#x4EE3;&#x7684;&#x5904;&#x7406;&#x5668;&#x90FD;&#x4F1A;&#x5141;&#x8BB8;&#x5BF9;&#x5199;-&#x8BFB;&#x64CD;&#x505A;&#x91CD;&#x6392;&#x5E8F;&#x3002;
&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x5185;&#x5B58;&#x53EF;&#x89C1;&#x6027;&#xFF0C;java&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x751F;&#x6210;&#x6307;&#x4EE4;&#x5E8F;&#x5217;&#x7684;&#x9002;&#x5F53;&#x4F4D;&#x7F6E;&#x4F1A;&#x63D2;&#x5165;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x6307;&#x4EE4;&#x6765;&#x7981;&#x6B62;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x5904;&#x7406;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x3002;JMM&#x628A;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x6307;&#x4EE4;&#x5206;&#x4E3A;&#x4E0B;&#x5217;&#x56DB;&#x7C7B;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x5C4F;&#x969C;&#x7C7B;&#x578B;</th>
<th>&#x6307;&#x4EE4;&#x793A;&#x4F8B;</th>
<th>&#x8BF4;&#x660E;</th>
</tr>
</thead>
<tbody>
<tr>
<td>LoadLoad Barriers</td>
<td>Load1; LoadLoad; Load2</td>
<td>Load2&#x786E;&#x4FDD;Load1&#x6570;&#x636E;&#x7684;&#x88C5;&#x8F7D;&#xFF0C;&#x4E4B;&#x524D;&#x4E8E;Load2&#x53CA;&#x6240;&#x6709;&#x540E;&#x7EED;&#x88C5;&#x8F7D;&#x6307;&#x4EE4;&#x7684;&#x88C5;&#x8F7D;&#x3002;</td>
</tr>
<tr>
<td>StoreStore Barriers</td>
<td>Store1; StoreStore; Store2</td>
<td>&#x786E;&#x4FDD;Store1&#x6570;&#x636E;&#x5BF9;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x5668;&#x53EF;&#x89C1;&#xFF08;&#x5237;&#x65B0;&#x5230;&#x5185;&#x5B58;&#xFF09;&#xFF0C;&#x4E4B;&#x524D;&#x4E8E;Store2&#x53CA;&#x6240;&#x6709;&#x540E;&#x7EED;&#x5B58;&#x50A8;&#x6307;&#x4EE4;&#x7684;&#x5B58;&#x50A8;</td>
</tr>
<tr>
<td>LoadStore Barriers</td>
<td>Load1; LoadStore; Store2</td>
<td>&#x786E;&#x4FDD;Load1&#x6570;&#x636E;&#x88C5;&#x8F7D;&#xFF0C;&#x4E4B;&#x524D;&#x4E8E;Store2&#x53CA;&#x6240;&#x6709;&#x540E;&#x7EED;&#x7684;&#x5B58;&#x50A8;&#x6307;&#x4EE4;&#x5237;&#x65B0;&#x5230;&#x5185;&#x5B58;</td>
</tr>
<tr>
<td>StoreLoad Barriers</td>
<td>Store1; StoreLoad; Load2</td>
<td>&#x786E;&#x4FDD;Store1&#x6570;&#x636E;&#x5BF9;&#x5176;&#x4ED6;&#x5904;&#x7406;&#x5668;&#x53D8;&#x5F97;&#x53EF;&#x89C1;&#xFF08;&#x6307;&#x5237;&#x65B0;&#x5230;&#x5185;&#x5B58;&#xFF09;&#xFF0C;&#x4E4B;&#x524D;&#x4E8E;Load2&#x53CA;&#x6240;&#x6709;&#x540E;&#x7EED;&#x88C5;&#x8F7D;&#x6307;&#x4EE4;&#x7684;&#x88C5;&#x8F7D;&#x3002;StoreLoad Barriers&#x4F1A;&#x4F7F;&#x8BE5;&#x5C4F;&#x969C;&#x4E4B;&#x524D;&#x7684;&#x6240;&#x6709;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x6307;&#x4EE4;&#xFF08;&#x5B58;&#x50A8;&#x548C;&#x88C5;&#x8F7D;&#x6307;&#x4EE4;&#xFF09;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x6267;&#x884C;&#x8BE5;&#x5C4F;&#x969C;&#x4E4B;&#x540E;&#x7684;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x6307;&#x4EE4;&#x3002;</td>
</tr>
</tbody>
</table>
<h4 id="&#x539F;&#x5B50;&#x6027;&#x53EF;&#x89C1;&#x6027;&#x4E0E;&#x6709;&#x5E8F;&#x6027;">&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x3001;&#x4E0E;&#x6709;&#x5E8F;&#x6027;</h4>
<p>Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#x662F;&#x56F4;&#x7ED5;&#x7740;&#x5728;&#x5E76;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5982;&#x4F55;&#x5904;&#x7406;&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x548C;&#x6709;&#x5E8F;&#x6027;&#x8FD9;&#x4E09;&#x4E2A;&#x7279;&#x5F81;&#x6765;&#x5EFA;&#x7ACB;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x770B;&#x770B;&#x8FD9;&#x4E09;&#x4E2A;&#x7279;&#x6027;&#x3002;</p>
<h5 id="&#x539F;&#x5B50;&#x6027;">&#x539F;&#x5B50;&#x6027;</h5>
<p>&#x901A;&#x4FD7;&#x7684;&#x5C06;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x4E0D;&#x80FD;&#x88AB;&#x5176;&#x4ED6;&#x64CD;&#x4F5C;&#x6253;&#x65AD;&#xFF0C;&#x8981;&#x4E48;&#x6210;&#x529F;&#xFF0C;&#x8981;&#x4E48;&#x5931;&#x8D25;&#x3002;Java&#x4E2D;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x8BBF;&#x95EE;&#x8BFB;&#x5199;&#x662F;&#x5177;&#x5907;&#x539F;&#x5B50;&#x6027;&#x7684;(&#x4F8B;&#x5916;&#x5C31;&#x662F;long&#x548C;double&#x7684;&#x975E;&#x539F;&#x5B50;&#x6027;&#x534F;&#x5B9A;&#xFF0C;&#x4F46;&#x662F;&#x51E0;&#x4E4E;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;)</p>
<h5 id="&#x53EF;&#x89C1;&#x6027;">&#x53EF;&#x89C1;&#x6027;</h5>
<p>&#x53EF;&#x89C1;&#x6027;&#x662F;&#x6307;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4FEE;&#x6539;&#x4E86;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;&#x503C;,&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x80FD;&#x591F;&#x7ACB;&#x5373;&#x5F97;&#x77E5;&#x8FD9;&#x4E2A;&#x4FEE;&#x6539;&#x3002;</p>
<h5 id="&#x6709;&#x5E8F;&#x6027;">&#x6709;&#x5E8F;&#x6027;</h5>
<p>&#x6709;&#x5E8F;&#x6027;&#x6307;&#x7684;&#x662F;&#x4EE3;&#x7801;&#x5728;&#x672C;&#x7EBF;&#x7A0B;&#x5185;&#x90E8;&#x89C2;&#x5BDF;&#x90FD;&#x662F;&#x6709;&#x5E8F;&#xFF1B;&#x5982;&#x679C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x89C2;&#x5BDF;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x662F;&#x65E0;&#x5E8F;&#x7684;&#x3002;
&#x524D;&#x534A;&#x53E5;&#x6307;&#x7684;&#x662F;as-if-serial&#x8BED;&#x4E49;&#xFF0C;&#x540E;&#x534A;&#x53E5;&#x6307;&#x7684;&#x662F;&quot;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&quot;&#x73B0;&#x8C61;&#x548C;&quot;&#x672C;&#x5730;&#x5185;&#x5B58;&#x548C;&#x4E3B;&#x5185;&#x5B58;&#x540C;&#x6B65;&#x5EF6;&#x8FDF;&quot;&#x73B0;&#x8C61;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6BCF;&#x4E00;&#x6B21;&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7A0B;&#x90FD;&#x8981;&#x53BB;&#x8003;&#x8651;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;&#x90A3;&#x4E48;&#x662F;&#x975E;&#x5E38;&#x8F9B;&#x82E6;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x8FDD;&#x80CC;&#x4E86;java&#x7684;&#x521D;&#x8877;&#xFF0C;&#x56E0;&#x4E3A;&#x8003;&#x8651;&#x7CFB;&#x7EDF;&#x5E95;&#x5C42;&#x7684;&#x5B9E;&#x73B0;&#x603B;&#x662F;&#x975E;&#x5E38;&#x8F9B;&#x82E6;&#x7684;&#x3002;&#x4ECE;jdk5&#x5F00;&#x59CB;java&#x4F7F;&#x7528;&#x65B0;&#x7684;jsr-133&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF0C;&#x5176;&#x4E2D;&#x901A;&#x8FC7;happen-before(&#x5148;&#x884C;&#x53D1;&#x751F;)&#x7684;&#x6982;&#x5FF5;&#x6765;&#x9610;&#x8FF0;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x7684;&#x5185;&#x5B58;&#x53EF;&#x89C1;&#x6027;&#x3002; &#x5982;&#x679C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x9700;&#x8981;&#x5BF9;&#x53E6;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x53EF;&#x89C1;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x5FC5;&#x987B;&#x5B58;&#x5728;happens-before&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x91CC;&#x63D0;&#x5230;&#x7684;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x65E2;&#x53EF;&#x4EE5;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E4B;&#x5185;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5728;&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x8BF4;&#x64CD;&#x4F5C;A&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x64CD;&#x4F5C;B,&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x8BF4;&#x5728;&#x53D1;&#x751F;&#x64CD;&#x4F5C;B&#x4E4B;&#x524D;,&#x4ECE;&#x64CD;&#x4F5C;A&#x4EA7;&#x751F;&#x7684;&#x5F71;&#x54CD;&#x80FD;&#x88AB;B&#x89C2;&#x5BDF;&#x5230;,&quot;&#x5F71;&#x54CD;&quot;&#x5305;&#x62EC;&#x4FEE;&#x6539;&#x4E86;&#x5185;&#x5B58;&#x4E2D;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x3001;&#x53D1;&#x9001;&#x4E86;&#x6D88;&#x606F;&#x3001;&#x8C03;&#x7528;&#x4E86;&#x65B9;&#x6CD5;&#x7B49;&#x3002;</p>
<h4 id="java&#x4E2D;&#x5929;&#x7136;&#x7684;happen-before&#x5148;&#x884C;&#x53D1;&#x751F;&#x539F;&#x5219;">Java&#x4E2D;&#x5929;&#x7136;&#x7684;happen-before(&#x5148;&#x884C;&#x53D1;&#x751F;)&#x539F;&#x5219;</h4>
<ul>
<li>&#x5728;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5185;&#xFF0C;&#x6309;&#x7167;&#x63A7;&#x5236;&#x6D41;&#x987A;&#x5E8F;&#xFF0C;&#x4E66;&#x5199;&#x5728;&#x524D;&#x9762;&#x7684;&#x64CD;&#x4F5C;happen-before&#x4E66;&#x5199;&#x5728;&#x540E;&#x9762;&#x7684;&#x64CD;&#x4F5C;</li>
<li>&#x5BF9;&#x540C;&#x4E00;&#x4E2A;monitor&#x7684;unlock&#x64CD;&#x4F5C;&#x90FD;happens-before&#x540C;&#x4E00;&#x4E2A;monitor&#x7684;lock</li>
<li>&#x5BF9;volatile&#x53D8;&#x91CF;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x90FD;happens-before&#x540C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x64CD;&#x4F5C;</li>
<li>&#x7EBF;&#x7A0B;&#x7684;start()&#x90FD;happens-before&#x7EBF;&#x7A0B;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;</li>
<li>&#x7EBF;&#x7A0B;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;happens-before&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4ECE;&#x8BE5;&#x7EBF;&#x7A0B;&#x4E0A;&#x7684;join()&#x6210;&#x529F;&#x8FD4;&#x56DE;&#x3002;</li>
<li>&#x7EBF;&#x7A0B;interrrupt()&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;happends-before&#x88AB;&#x4E2D;&#x65AD;&#x7EBF;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#x68C0;&#x6D4B;&#x5230;&#x4E2D;&#x65AD;&#x4E8B;&#x4EF6;&#x7684;&#x53D1;&#x751F;</li>
<li>&#x5982;&#x679C;A happens-before B,&#x4E14;B happens-before C&#xFF0C;&#x90A3;&#x4E48;A happens-before C.</li>
</ul>
<h4 id="java&#x4E2D;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x7684;&#x5173;&#x952E;&#x5B57;">Java&#x4E2D;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x7684;&#x5173;&#x952E;&#x5B57;</h4>
<h5 id="volatile">volatile</h5>
<p>&#x5F53;&#x5199;&#x4E00;&#x4E2A;volatile&#x53D8;&#x91CF;&#x65F6;&#xFF0C;JMM&#x4F1A;&#x628A;&#x8BE5;&#x7EBF;&#x7A0B;&#x5BF9;&#x5E94;&#x7684;&#x672C;&#x5730;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x5237;&#x65B0;&#x5230;&#x4E3B;&#x5185;&#x5B58;&#x3002;
&#x5F53;&#x8BFB;&#x4E00;&#x4E2A;volatile&#x53D8;&#x91CF;&#x65F6;&#xFF0C;JMM&#x4F1A;&#x628A;&#x8BE5;&#x7EBF;&#x7A0B;&#x5BF9;&#x5E94;&#x7684;&#x672C;&#x5730;&#x5185;&#x5B58;&#x7F6E;&#x4E3A;&#x65E0;&#x6548;&#x3002;&#x7EBF;&#x7A0B;&#x63A5;&#x4E0B;&#x6765;&#x5C06;&#x4ECE;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#x8BFB;&#x53D6;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x3002;</p>
<p>&#x524D;&#x6587;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x8FC7;&#x91CD;&#x6392;&#x5E8F;&#x5206;&#x4E3A;&#x7F16;&#x8BD1;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x548C;&#x5904;&#x7406;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;volatile&#x5185;&#x5B58;&#x8BED;&#x4E49;&#xFF0C;JMM&#x4F1A;&#x5206;&#x522B;&#x9650;&#x5236;&#x8FD9;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x91CD;&#x6392;&#x5E8F;&#x7C7B;&#x578B;&#x3002;&#x4E0B;&#x9762;&#x662F;JMM&#x9488;&#x5BF9;&#x7F16;&#x8BD1;&#x5668;&#x5236;&#x5B9A;&#x7684;volatile&#x91CD;&#x6392;&#x5E8F;&#x89C4;&#x5219;&#x8868;&#xFF1A;
<img src="http://7xlvme.com1.z0.glb.clouddn.com/volatile_in_jmm.png" alt="volatile&#x6392;&#x5E8F;&#x89C4;&#x5219;">
&#x4ECE;&#x4E0A;&#x8868;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF1A;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x7B2C;&#x4E09;&#x884C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5355;&#x5143;&#x683C;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF1A;&#x5728;&#x7A0B;&#x5E8F;&#x987A;&#x5E8F;&#x4E2D;&#xFF0C;&#x5F53;&#x7B2C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x4E3A;&#x666E;&#x901A;&#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x6216;&#x5199;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x7B2C;&#x4E8C;&#x4E2A;&#x64CD;&#x4F5C;&#x4E3A;volatile&#x5199;&#xFF0C;&#x5219;&#x7F16;&#x8BD1;&#x5668;&#x4E0D;&#x80FD;&#x91CD;&#x6392;&#x5E8F;&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x5F53;&#x7B2C;&#x4E8C;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;volatile&#x5199;&#x65F6;&#xFF0C;&#x4E0D;&#x7BA1;&#x7B2C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x90FD;&#x4E0D;&#x80FD;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x8FD9;&#x4E2A;&#x89C4;&#x5219;&#x786E;&#x4FDD;volatile&#x5199;&#x4E4B;&#x524D;&#x7684;&#x64CD;&#x4F5C;&#x4E0D;&#x4F1A;&#x88AB;&#x7F16;&#x8BD1;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x5230;volatile&#x5199;&#x4E4B;&#x540E;&#x3002;</p>
<p>&#x5F53;&#x7B2C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;volatile&#x8BFB;&#x65F6;&#xFF0C;&#x4E0D;&#x7BA1;&#x7B2C;&#x4E8C;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x90FD;&#x4E0D;&#x80FD;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x8FD9;&#x4E2A;&#x89C4;&#x5219;&#x786E;&#x4FDD;volatile&#x8BFB;&#x4E4B;&#x540E;&#x7684;&#x64CD;&#x4F5C;&#x4E0D;&#x4F1A;&#x88AB;&#x7F16;&#x8BD1;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x5230;volatile&#x8BFB;&#x4E4B;&#x524D;&#x3002;</p>
<p>&#x5F53;&#x7B2C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;volatile&#x5199;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;volatile&#x8BFB;&#x65F6;&#xFF0C;&#x4E0D;&#x80FD;&#x91CD;&#x6392;&#x5E8F;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;volatile&#x7684;&#x5185;&#x5B58;&#x8BED;&#x4E49;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x751F;&#x6210;&#x5B57;&#x8282;&#x7801;&#x65F6;&#xFF0C;&#x4F1A;&#x5728;&#x6307;&#x4EE4;&#x5E8F;&#x5217;&#x4E2D;&#x63D2;&#x5165;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x6765;&#x7981;&#x6B62;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x5904;&#x7406;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x5BF9;&#x4E8E;&#x7F16;&#x8BD1;&#x5668;&#x6765;&#x8BF4;&#xFF0C;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x6700;&#x4F18;&#x5E03;&#x7F6E;&#x6765;&#x6700;&#x5C0F;&#x5316;&#x63D2;&#x5165;&#x5C4F;&#x969C;&#x7684;&#x603B;&#x6570;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#xFF0C;&#x4E3A;&#x6B64;&#xFF0C;JMM&#x91C7;&#x53D6;&#x4FDD;&#x5B88;&#x7B56;&#x7565;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x57FA;&#x4E8E;&#x4FDD;&#x5B88;&#x7B56;&#x7565;&#x7684;JMM&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x63D2;&#x5165;&#x7B56;&#x7565;&#xFF1A;</p>
<ol>
<li>
<p>&#x5728;&#x6BCF;&#x4E2A;volatile&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x524D;&#x9762;&#x63D2;&#x5165;&#x4E00;&#x4E2A;StoreStore&#x5C4F;&#x969C;&#x3002;</p>
</li>
<li>
<p>&#x5728;&#x6BCF;&#x4E2A;volatile&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x540E;&#x9762;&#x63D2;&#x5165;&#x4E00;&#x4E2A;StoreLoad&#x5C4F;&#x969C;&#x3002;</p>
</li>
<li>
<p>&#x5728;&#x6BCF;&#x4E2A;volatile&#x8BFB;&#x64CD;&#x4F5C;&#x7684;&#x540E;&#x9762;&#x63D2;&#x5165;&#x4E00;&#x4E2A;LoadLoad&#x5C4F;&#x969C;&#x3002;</p>
</li>
<li>
<p>&#x5728;&#x6BCF;&#x4E2A;volatile&#x8BFB;&#x64CD;&#x4F5C;&#x7684;&#x540E;&#x9762;&#x63D2;&#x5165;&#x4E00;&#x4E2A;LoadStore&#x5C4F;&#x969C;&#x3002;</p>
</li>
</ol>
<p>&#x4E0A;&#x8FF0;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x63D2;&#x5165;&#x7B56;&#x7565;&#x975E;&#x5E38;&#x4FDD;&#x5B88;&#xFF0C;&#x4F46;&#x5B83;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x5728;&#x4EFB;&#x610F;&#x5904;&#x7406;&#x5668;&#x5E73;&#x53F0;&#xFF0C;&#x4EFB;&#x610F;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x90FD;&#x80FD;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;volatile&#x5185;&#x5B58;&#x8BED;&#x4E49;&#x3002;&#x56E0;&#x4E3A;volatile&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x53EF;&#x89C1;&#x6027;&#x4EE5;&#x53CA;&#x91CD;&#x6392;&#x5E8F;&#x4F18;&#x5316;&#x3002;</p>
<h5 id="synchronized">synchronized</h5>
<p>&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x80FD;&#x6301;&#x6709;&#x76D1;&#x89C6;&#x5668;&#xFF0C;&#x8FD9;&#x4EE3;&#x8868;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x8FDB;&#x5165;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x53EA;&#x6709;&#x5728;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x9000;&#x51FA;&#x4E86;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x5757;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x8FDB;&#x5165;&#xFF0C;&#x540C;&#x65F6;&#x5728;&#x9000;&#x51FA;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x5757;&#x7684;&#x65F6;&#x5019;JMM&#x4F1A;&#x628A;&#x8BE5;&#x7EBF;&#x7A0B;&#x5BF9;&#x5E94;&#x7684;&#x672C;&#x5730;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x5237;&#x65B0;&#x5230;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x5BF9;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x662F;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x8FDB;&#x5165;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x5757;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x76D1;&#x89C6;&#x5668;&#xFF0C;&#x5728;&#x83B7;&#x53D6;&#x76D1;&#x89C6;&#x5668;&#x7684;&#x540C;&#x65F6;&#x4F1A;&#x4F7F;&#x5F97;&#x5F53;&#x524D;&#x5904;&#x7406;&#x5668;&#x672C;&#x5730;&#x7684;&#x7F13;&#x5B58;&#x65E0;&#x6548;&#xFF0C;&#x800C;&#x662F;&#x4F1A;&#x4ECE;&#x4E3B;&#x5B58;&#x4E2D;&#x540C;&#x6B65;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x524D;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x6240;&#x6709;&#x5199;&#x5165;&#x4E86;&#x3002;</p>
<p><figure class="highlight java"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">synchronized</span>(<span class="keyword">new</span> Object()) {</span><br><span class="line">    dosomething();</span><br><span class="line">}</span><br></pre></td></tr></table></figure></p>
<p>&#x5982;&#x679C;&#x7528;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6765;&#x8BBE;&#x7F6E;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x662F;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x7F16;&#x8BD1;&#x5668;&#x77E5;&#x9053;&#x4E0D;&#x4F1A;&#x6709;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x6765;&#x83B7;&#x53D6;&#x540C;&#x4E00;&#x4E2A;&#x800C;&#x76D1;&#x89C6;&#x5668;,&#x6240;&#x4EE5;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x5B8C;&#x5168;&#x7ED9;&#x4F60;&#x79FB;&#x9664;
&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x4E24;&#x4E2A;&#x76D1;&#x89C6;&#x5668;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x76D1;&#x89C6;&#x5668;&#x9501;&#x4E0A;&#x540C;&#x6B65;&#x624D;&#x80FD;&#x89E6;&#x53D1;happens-before&#xFF0C;&#x5982;&#x679C;&#x7EBF;&#x7A0B;A&#x5728;&#x5BF9;&#x8C61;X&#x4E0A;&#x540C;&#x6B65;&#x65F6;&#x53EF;&#x89C1;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x5728;&#x5BF9;&#x8C61;Y&#x4E0A;&#x540C;&#x6B65;&#x540E;&#x4E0D;&#x4E00;&#x5B9A;&#x5C31;&#x5BF9;&#x7EBF;&#x7A0B;B&#x53EF;&#x89C1;&#x3002;&#x6240;&#x4EE5;&#x83B7;&#x53D6;&#x548C;&#x91CA;&#x653E;&#x5FC5;&#x987B;&#x5339;&#x914D;&#x3002;</p>
<p>synchronized&#x5173;&#x952E;&#x5B57;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x3001;&#x4E0E;&#x6709;&#x5E8F;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5982;&#x6B64;&#x5F3A;&#x5927;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8BB8;&#x591A;&#x4EBA;&#x5C06;&#x5B83;&#x5927;&#x91CF;&#x7528;&#x5728;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x4F34;&#x968F;&#x7740;&#x8D8A;&#x5927;&#x7684;&#x6027;&#x80FD;&#x5F71;&#x54CD;&#x3002;</p>
<h5 id="final">final</h5>
<ol>
<li>
<p>&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5185;&#x5BF9;&#x4E00;&#x4E2A;final&#x57DF;&#x7684;&#x5199;&#x5165;&#xFF0C;&#x4E0E;&#x968F;&#x540E;&#x628A;&#x8FD9;&#x4E2A;&#x88AB;&#x6784;&#x9020;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8D4B;&#x503C;&#x7ED9;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x4E0D;&#x80FD;&#x91CD;&#x6392;&#x5E8F;&#x3002;</p>
</li>
<li>
<p>&#x521D;&#x6B21;&#x8BFB;&#x4E00;&#x4E2A;&#x5305;&#x542B;final&#x57DF;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x4E0E;&#x968F;&#x540E;&#x521D;&#x6B21;&#x8BFB;&#x8FD9;&#x4E2A;final&#x57DF;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x4E0D;&#x80FD;&#x91CD;&#x6392;&#x5E8F;&#x3002;</p>
</li>
</ol>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4F7F;&#x7528;final&#x5B57;&#x6BB5;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x521D;&#x59CB;&#x5316;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5728;&#x4E0D;&#x540C;&#x6B65;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x81EA;&#x7531;&#x8BBF;&#x95EE;&#x548C;&#x5171;&#x4EAB;&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x3002;</p>
<h3 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h3>
<p>&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7801;&#x4E2D;&#x5F71;&#x54CD;&#x591A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x4E3B;&#x8981;&#x6709;&#x5185;&#x5B58;&#x3001;&#x5904;&#x7406;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x3001;&#x7F16;&#x8BD1;&#x5668;&#x91CD;&#x6392;&#x5E8F;&#x7B49;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x65B9;&#x9762;&#x95EE;&#x9898;&#xFF0C;&#x800C;JMM&#x5219;&#x5C4F;&#x853D;&#x4E86;&#x5E95;&#x5C42;&#x7EC6;&#x8282;&#xFF0C;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4E86;&#x62BD;&#x8C61;&#x5904;&#x7406;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x5355;&#x7EBF;&#x7A0B;&#x7684;as-if-serial&#x8BED;&#x4E49;&#x4EE5;&#x53CA;&#x591A;&#x7EBF;&#x7A0B;&#x4E0B;&#x5408;&#x7406;&#x4F7F;&#x7528;Java&#x63D0;&#x4F9B;&#x7684;&#x5173;&#x952E;&#x5B57;&#x6216;&#x8005;&#x5F00;&#x53D1;&#x5305;&#x6765;&#x4FDD;&#x8BC1;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3002;</p>
<h3 id="&#x53C2;&#x8003;&#x6587;&#x6863;">&#x53C2;&#x8003;&#x6587;&#x6863;</h3>
<p><a href="http://www.infoq.com/cn/articles/java-memory-model-1" target="_blank" rel="external">http://www.infoq.com/cn/articles/java-memory-model-1</a></p>
<p>&lt;&lt;&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&gt;&gt;</p>
</span>
      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/jvm/" rel="tag">#jvm</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-prev post-nav-item">
            
          </div>

          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/08/05/you-should-know-from-mysql-to-mongodb/" rel="next">从mysql到mongodb你应该快速了解的内容</a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>

 </div>

       

        
          <div class="comments" id="comments">
            
              <div class="ds-thread" data-thread-key="2018/08/12/what-is-java-memory-model/"
                   data-title="一篇文章讲懂Java内存模型" data-url="http://yoursite.com/2018/08/12/what-is-java-memory-model/">
              </div>
            
          </div>
        
      </div>

      
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" src="http://7xlvme.com1.z0.glb.clouddn.com/avatar.jpg" alt="generalthink" itemprop="image"/>
          <p class="site-author-name" itemprop="name">generalthink</p>
        </div>
        <p class="site-description motion-element" itemprop="description">相信自己做一个自信的人</p>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">23</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          <div class="site-state-item site-state-categories">
            <a href="/categories">
              <span class="site-state-item-count">12</span>
              <span class="site-state-item-name">分类</span>
              </a>
          </div>

          <div class="site-state-item site-state-tags">
            <a href="/tags">
              <span class="site-state-item-count">14</span>
              <span class="site-state-item-name">标签</span>
              </a>
          </div>

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="menu-item-icon icon-next-feed"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/generalthink" target="_blank">github</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/think123" target="_blank">zhihu</a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">友情链接</p>
            
              <span class="links-of-author-item">
              <a href="http://www.baidu.com" target="_blank">baidu</a>
              </span>
            
              <span class="links-of-author-item">
              <a href="http://www.it2048.cn" target="_blank">it2048</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator"></div>
          <div class="post-toc">
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#java运行时数据区域"><span class="nav-text">Java运行时数据区域</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#多线程下编码问题"><span class="nav-text">多线程下编码问题</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#什么是java内存模型"><span class="nav-text">什么是Java内存模型</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#as-if-serial语义"><span class="nav-text">as-if-serial语义</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#处理器排序与内存屏障指令"><span class="nav-text">处理器排序与内存屏障指令</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#原子性可见性与有序性"><span class="nav-text">原子性、可见性、与有序性</span></a><ol class="nav-child"><li class="nav-item nav-level-5"><a class="nav-link" href="#原子性"><span class="nav-text">原子性</span></a></li><li class="nav-item nav-level-5"><a class="nav-link" href="#可见性"><span class="nav-text">可见性</span></a></li><li class="nav-item nav-level-5"><a class="nav-link" href="#有序性"><span class="nav-text">有序性</span></a></li></ol></li><li class="nav-item nav-level-4"><a class="nav-link" href="#java中天然的happen-before先行发生原则"><span class="nav-text">Java中天然的happen-before(先行发生)原则</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#java中线程同步的关键字"><span class="nav-text">Java中线程同步的关键字</span></a><ol class="nav-child"><li class="nav-item nav-level-5"><a class="nav-link" href="#volatile"><span class="nav-text">volatile</span></a></li><li class="nav-item nav-level-5"><a class="nav-link" href="#synchronized"><span class="nav-text">synchronized</span></a></li><li class="nav-item nav-level-5"><a class="nav-link" href="#final"><span class="nav-text">final</span></a></li></ol></li></ol></li><li class="nav-item nav-level-3"><a class="nav-link" href="#总结"><span class="nav-text">总结</span></a></li><li class="nav-item nav-level-3"><a class="nav-link" href="#参考文档"><span class="nav-text">参考文档</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator"></div>
        </section>
      

    </div>
  </aside>


    </main>



<div id="lv-container" data-id="city" data-uid="MTAyMC8zODYzMS8xNTE1OQ==">
  <script type="text/javascript">
    var livereQuery = {short_name:"generalthink"};
     (function(d, s) {
       var j, e = d.getElementsByTagName(s)[0];

       if (typeof LivereTower === 'function') { return; }

       j = d.createElement(s);
       j.src = 'https://cdn-city.livere.com/js/embed.dist.js';
       j.async = true;

       e.parentNode.insertBefore(j, e);
   })(document, 'script');
  </script>


    <footer id="footer" class="footer">
      <div class="footer-inner"> <div class="powered-by">
  <a href="http://www.miitbeian.gov.cn/">蜀ICP备16009462号</a>
</div>


<div class="theme-info">

  Copyright &copy; &nbsp;  2014 - 
  <span itemprop="copyrightYear">2018</span>
  <span class="author" itemprop="copyrightHolder">generalthink.All rights reserved.</span>
</div>


<div class="copyright" >
  
</div>


 </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  
  
  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>
  <script type="text/javascript" src="/js/fancy-box.js?v=0.4.5.1"></script>


  <script type="text/javascript" src="/js/helpers.js?v=0.4.5.1"></script>
  

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/js/motion_global.js?v=0.4.5.1" id="motion.global"></script>




  <script type="text/javascript" src="/js/nav-toggle.js?v=0.4.5.1"></script>
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  
<script type="text/javascript" src="/js/bootstrap.scrollspy.js?v=0.4.5.1" id="bootstrap.scrollspy.custom"></script>


<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 0.4 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    var $tocContent = $('.post-toc-content');
    if (isDesktop() && CONFIG.sidebar === 'post') {
      if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
        displaySidebar();
      }
    }
  });
</script>



  <script type="text/javascript">
    $(document).ready(function () {
      if (CONFIG.sidebar === 'always') {
        displaySidebar();
      }
      if (isMobile()) {
        FastClick.attach(document.body);
      }
    });
  </script>

  

  
  

  
  <script type="text/javascript" src="/js/lazyload.js"></script>
  <script type="text/javascript">
    $(function () {
      $("#posts").find('img').lazyload({
        placeholder: "/images/loading.gif",
        effect: "fadeIn"
      });
    });
  </script>
</body>
</html>
