<!doctype html>
<html class="theme-next use-motion theme-next-mist">
<head>
  

<meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>
<meta name="baidu-site-verification" content="EYxran2Vav" />

<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />








  <link rel="stylesheet" type="text/css" href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5"/>




<link rel="stylesheet" type="text/css" href="/css/main.css?v=0.4.5.1"/>


    <meta name="description" content="相信自己做一个自信的人" />



  <meta name="keywords" content="synchronized,jvm,偏向锁,轻量级锁,重量级锁" />



  <link rel="alternate" href="/atom.xml" title="I am TKing" type="application/atom+xml" />



  <link rel="shorticon icon" type="image/x-icon" href="/favicon.ico?v=0.4.5.1" />


<meta name="description" content="多线程编码中,我们常用到synchronized关键字,都知道它是加锁关键字，也或多或少听说过轻量级锁，重量级锁，偏向锁这些关键字，可是我们知道这些具体指的是什么吗？为了我们更优的使用，JVM团队在背后做了多少努力?">
<meta property="og:type" content="article">
<meta property="og:title" content="java中锁的优化">
<meta property="og:url" content="http://yoursite.com/2018/07/19/lock-optimization-about-java/index.html">
<meta property="og:site_name" content="I am TKing">
<meta property="og:description" content="多线程编码中,我们常用到synchronized关键字,都知道它是加锁关键字，也或多或少听说过轻量级锁，重量级锁，偏向锁这些关键字，可是我们知道这些具体指的是什么吗？为了我们更优的使用，JVM团队在背后做了多少努力?">
<meta property="og:updated_time" content="2018-07-19T14:44:39.838Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="java中锁的优化">
<meta name="twitter:description" content="多线程编码中,我们常用到synchronized关键字,都知道它是加锁关键字，也或多或少听说过轻量级锁，重量级锁，偏向锁这些关键字，可是我们知道这些具体指的是什么吗？为了我们更优的使用，JVM团队在背后做了多少努力?">


<script type="text/javascript" id="hexo.configuration">
  var CONFIG = {
    scheme: 'Mist',
    sidebar: 'post'
  };
</script>
<script async src="//dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js">
</script>
  <title> java中锁的优化 | I am TKing </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  <!--[if lte IE 8]>
  <div style=' clear: both; height: 59px; padding:0 0 0 15px; position: relative;margin:0 auto;'>
    <a href="http://windows.microsoft.com/en-US/internet-explorer/products/ie/home?ocid=ie6_countdown_bannercode">
      <img src="http://7u2nvr.com1.z0.glb.clouddn.com/picouterie.jpg" border="0" height="42" width="820"
           alt="You are using an outdated browser. For a faster, safer browsing experience, upgrade for free today or use other browser ,like chrome firefox safari."
           style='margin-left:auto;margin-right:auto;display: block;'/>
    </a>
  </div>
<![endif]-->
  



  <div class="container one-column page-post-detail">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><h1 class="site-meta">
  <span class="logo-line-before"><i></i></span>
  <a href="/" class="brand" rel="start">
      <span class="logo">
        <i class="icon-next-logo"></i>
      </span>
      <span class="site-title">I am TKing</span>
  </a>
  <span class="logo-line-after"><i></i></span>
</h1>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            <i class="menu-item-icon icon-next-home"></i> <br />
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            <i class="menu-item-icon icon-next-categories"></i> <br />
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            <i class="menu-item-icon icon-next-about"></i> <br />
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            <i class="menu-item-icon icon-next-archives"></i> <br />
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-commonweal">
          <a href="/404.html" rel="section">
            <i class="menu-item-icon icon-next-commonweal"></i> <br />
            公益404
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            <i class="menu-item-icon icon-next-tags"></i> <br />
            标签
          </a>
        </li>
      

      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div id="content" class="content"> 

  <div id="posts" class="posts-expand">
    

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">
    <header class="post-header">

      
      
        <h1 class="post-title" itemprop="name headline">
          
          
            
              java中锁的优化
            
          
        </h1>
      

      <div class="post-meta">
        <span class="post-time">
          发表于
          <time itemprop="dateCreated" datetime="2018-07-19T21:22:46+08:00" content="2018-07-19">
            2018-07-19
          </time>
        </span>

        
          <span class="post-category" >
            &nbsp; | &nbsp; 分类于
            
              <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                <a href="/categories/java/" itemprop="url" rel="index">
                  <span itemprop="name">java</span>
                </a>
              </span>

              
              
                ， 
              

            
              <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                <a href="/categories/java/jvm/" itemprop="url" rel="index">
                  <span itemprop="name">jvm</span>
                </a>
              </span>

              
              

            
          </span>
        

        
          
            <span class="post-comments-count">
              &nbsp; | &nbsp;
              <a href="/2018/07/19/lock-optimization-about-java/#comments" itemprop="discussionUrl">
                <span class="post-comments-count ds-thread-count" data-thread-key="2018/07/19/lock-optimization-about-java/" itemprop="commentsCount"></span>
              </a>
            </span>
          
        
        
        
           <span class="post-comments-count">
            <span id="busuanzi_container_page_pv">
              &nbsp; | &nbsp;<span id="busuanzi_value_page_pv"></span>次阅读
            </span>
          </span>
        
      </div>
    </header>

    <div class="post-body">

      
      

      
        <span itemprop="articleBody"><p>###. &#x4E00;&#x5207;&#x90FD;&#x59CB;&#x4E8E;&#x7EBF;&#x7A0B;(Thread)</p>
<p>&#x7EBF;&#x7A0B;&#x662F;&#x6BD4;&#x8FDB;&#x7A0B;&#x66F4;&#x52A0;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x8C03;&#x5EA6;&#x6267;&#x884C;&#x5355;&#x4F4D;,&#x7EBF;&#x7A0B;&#x7684;&#x5F15;&#x5165;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x548C;&#x6267;&#x884C;&#x8C03;&#x670D;&#x5206;&#x5F00;&#xFF0C;&#x5404;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#x8FDB;&#x7A0B;&#x8D44;&#x6E90;&#x53C8;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x8C03;&#x5EA6;&#xFF0C;&#x4E3B;&#x6D41;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x90FD;&#x63D0;&#x4F9B;&#x4E86;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#xFF0C;Java&#x8FD9;&#x63D0;&#x4F9B;&#x4E86;&#x5728;&#x4E0D;&#x540C;&#x786C;&#x4EF6;&#x548C;&#x4E0D;&#x540C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E73;&#x53F0;&#x4E0A;&#x5BF9;&#x7EBF;&#x7A0B;&#x64CD;&#x4F5C;&#x7684;&#x7EDF;&#x4E00;&#x5904;&#x7406;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x4E3B;&#x8981;&#x6709;3&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ol>
<li>&#x4F7F;&#x7528;&#x5185;&#x6838;&#x7EBF;&#x7A0B;(&#x76F4;&#x63A5;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x652F;&#x6301;)&#x5B9E;&#x73B0;,&#x4F46;&#x662F;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x53BB;&#x4F7F;&#x7528;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x7684;&#x4E00;&#x79CD;&#x9AD8;&#x7EA7;&#x63A5;&#x53E3;&#x2014;&#x2014;&#x8F7B;&#x91CF;&#x7EA7;&#x8FDB;&#x7A0B;</li>
<li>&#x4F7F;&#x7528;&#x7528;&#x6237;&#x7EBF;&#x7A0B;(&#x9664;&#x4E86;&#x5185;&#x6838;&#x7EBF;&#x7A0B;)&#x5B9E;&#x73B0;</li>
<li>&#x4F7F;&#x7528;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#x52A0;&#x8F7B;&#x91CF;&#x7EA7;&#x8FDB;&#x7A0B;&#x6DF7;&#x5408;&#x5B9E;&#x73B0;&#x3002;</li>
</ol>
<p>&#x800C;java&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#x5C31;&#x662F;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x6761;&#x8F7B;&#x91CF;&#x7EA7;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;,&#x6240;&#x4EE5;&#x5982;&#x679C;&#x8981;&#x963B;&#x585E;&#x6216;&#x8005;&#x5524;&#x9192;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x9700;&#x8981;&#x9700;&#x8981;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x652F;&#x6301;,&#x56E0;&#x4E3A;&#x8981;&#x4ECE;&#x7528;&#x6237;&#x6001;&#x8F6C;&#x6362;&#x5230;&#x6838;&#x5FC3;&#x6001;&#x4E2D;&#x9700;&#x8981;&#x8017;&#x8D39;&#x5F88;&#x591A;&#x7684;&#x5904;&#x7406;&#x5668;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x624D;&#x6709;&#x8BF4;&#x6CD5;&#x8BF4;synchronized&#x662F;java&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x91CF;&#x7EA7;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x6765;&#x6211;&#x4EEC;&#x5F88;&#x5C11;&#x4F7F;&#x7528;(&#x4FDD;&#x8BC1;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x5904;&#x7406;synchronized&#x5173;&#x952E;&#x5B57;&#x8FD8;&#x6709;JUC&#x5305;&#x4E0B;&#x63D0;&#x4F9B;&#x7684;&#x5176;&#x4ED6;&#x652F;&#x6301;)&#xFF0C;&#x4E8C;&#x6765;&#x865A;&#x62DF;&#x673A;&#x672C;&#x8EAB;&#x4E5F;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x4F18;&#x5316;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x8C08;&#x7684;&#x5C31;&#x662F;&#x9501;&#x7684;&#x4F18;&#x5316;&#x3002;</p>
<p>###. synchronized&#x5C0F;&#x660E;&#x5BF9;&#x6211;&#x7684;&#x4EE3;&#x7801;&#x505A;&#x4E86;&#x4EC0;&#x4E48;?</p>
<p>&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;synchronized&#x5173;&#x952E;&#x5B57;&#x7ECF;&#x8FC7;&#x7F16;&#x8BD1;&#x4E4B;&#x540E;&#x4F1A;&#x7EBF;&#x7A0B;monitorenter&#x548C;monitorexit&#x8FD9;&#x4E24;&#x4E2A;&#x5B57;&#x8282;&#x7801;&#x6307;&#x4EE4;,&#x8FD9;&#x4E2A;&#x4E24;&#x4E2A;&#x5B57;&#x8282;&#x7801;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;reference&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x6765;&#x6307;&#x660E;&#x9700;&#x8981;&#x9501;&#x5B9A;&#x548C;&#x89E3;&#x9501;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x53EF;&#x4EE5;&#x5728;&#x4EE3;&#x7801;&#x5757;&#x4E2D;&#x6307;&#x660E;&#x9700;&#x8981;&#x52A0;&#x9501;&#x7684;&#x5BF9;&#x8C61;&#x6216;&#x8005;&#x5728;&#x6839;&#x636E;&#x4FEE;&#x9970;&#x7684;&#x662F;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;&#x8FD8;&#x662F;&#x7C7B;&#x65B9;&#x6CD5;(static&#x65B9;&#x6CD5;)&#x6765;&#x83B7;&#x53D6;&#x5BF9;&#x5E94;&#x7684;&#x5BF9;&#x5E94;&#x5B9E;&#x4F8B;&#x6216;&#x8005;Class&#x5BF9;&#x8C61;&#x6765;&#x8FDB;&#x884C;&#x52A0;&#x9501;&#x3002;</p>
<p>&#x65E2;&#x7136;&#x662F;&#x52A0;&#x9501;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x52A0;&#x9501;&#x4E4B;&#x524D;&#x80AF;&#x5B9A;&#x8981;&#x53BB;&#x83B7;&#x53D6;&#x9501;&#xFF0C;&#x5982;&#x679C;&#x83B7;&#x53D6;&#x5230;&#x4E86;&#x5C31;&#x628A;&#x9501;&#x7684;&#x8BA1;&#x6570;&#x5668;&#x52A0;1,&#x91CA;&#x653E;&#x9501;&#x5C31;&#x51CF;&#x53BB;1&#xFF0C;&#x5F53;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x503C;&#x4E3A;0&#x7684;&#x65F6;&#x5019;&#x5C31;&#x91CA;&#x653E;&#x9501;,monitorexit&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;&#x4F1A;&#x5728;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x7684;&#x65F6;&#x5019;&#x5C06;&#x8BA1;&#x6570;&#x5668;&#x51CF;&#x53BB;1&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x83B7;&#x53D6;&#x5230;&#x9501;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x963B;&#x585E;&#x7B49;&#x5F85;&#xFF0C;&#x77E5;&#x9053;&#x5BF9;&#x8C61;&#x9501;&#x88AB;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x91CA;&#x653E;&#xFF0C;&#x5728;&#x91CD;&#x65B0;&#x53BB;&#x7ADE;&#x4E89;&#x3002;</p>
<h3 id="&#x9501;&#x7684;&#x4F18;&#x5316;">&#x9501;&#x7684;&#x4F18;&#x5316;</h3>
<h4 id="&#x81EA;&#x65CB;&#x9501;&#x4EE5;&#x53CA;&#x81EA;&#x9002;&#x5E94;&#x81EA;&#x65CB;">&#x81EA;&#x65CB;&#x9501;&#x4EE5;&#x53CA;&#x81EA;&#x9002;&#x5E94;&#x81EA;&#x65CB;</h4>
<p>&#x5728;&#x8BB2;&#x8FD9;&#x4E24;&#x4E2A;&#x9501;&#x4E4B;&#x524D;&#x6211;&#x5148;&#x8BB2;&#x4E00;&#x4E2A;&#x5C0F;&#x6545;&#x4E8B;&#x3002;</p>
<p>&#x5C0F;&#x660E;&#x4E2D;&#x5348;&#x8D81;&#x7740;&#x4F11;&#x606F;&#x65F6;&#x95F4;&#x53BB;&#x94F6;&#x884C;&#x529E;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x5C0F;&#x660E;&#x53BB;&#x7684;&#x65F6;&#x5019;&#x5C0F;&#x660E;&#x524D;&#x9762;&#x6709;&#x4EBA;&#x5728;&#x529E;&#x7406;&#x4E1A;&#x52A1;&#xFF0C;&#x603B;&#x4E0D;&#x80FD;&#x770B;&#x5230;&#x6709;&#x4EBA;&#x529E;&#x7406;&#x5C31;&#x56DE;&#x53BB;&#x5427;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x4EC5;&#x96BE;&#x5F97;&#x8DD1;&#x8FD8;&#x6D6A;&#x8D39;&#x4E86;&#x4E2D;&#x5348;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5C0F;&#x660E;&#x51B3;&#x5B9A;&#x591A;&#x7B49;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x770B;&#x770B;&#x522B;&#x4EBA;&#x80FD;&#x4E0D;&#x80FD;&#x529E;&#x7406;&#x5B8C;,&#x4F46;&#x662F;&#x4E5F;&#x4E0D;&#x80FD;&#x4E00;&#x76F4;&#x7B49;&#x5440;&#xFF0C;&#x7B49;&#x4E45;&#x4E86;&#x4E0B;&#x5348;&#x4E0A;&#x73ED;&#x5C31;&#x4F1A;&#x8FDF;&#x5230;&#xFF0C;&#x4F1A;&#x88AB;&#x9886;&#x5BFC;&#x6279;&#x8BC4;&#x7684;&#xFF0C;&#x4E8E;&#x662F;&#x5C0F;&#x660E;&#x51B3;&#x5B9A;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#xFF0C;&#x6682;&#x4E14;&#x5C31;&#x4E3A;&#x5341;&#x5206;&#x949F;&#x5427;&#xFF0C;&#x540E;&#x9762;&#x5341;&#x5206;&#x949F;&#x5230;&#x4E86;&#x524D;&#x9762;&#x8FD8;&#x6709;&#x4EBA;&#x5728;&#x529E;&#x7406;&#xFF0C;&#x5C0F;&#x660E;&#x51B3;&#x5B9A;&#x4E0D;&#x7B49;&#x4E86;&#x5148;&#x56DE;&#x53BB;&#x4E0A;&#x73ED;&#xFF0C;&#x660E;&#x5929;&#x518D;&#x6765;&#x3002;
&#x7B2C;&#x4E8C;&#x5929;&#xFF0C;&#x5C0F;&#x660E;&#x53C8;&#x6765;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x524D;&#x9762;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#xFF0C;&#x5C0F;&#x660E;&#x7A81;&#x7136;&#x6709;&#x70B9;&#x7EDD;&#x671B;&#xFF0C;&#x5C0F;&#x660E;&#x95EE;&#x4E86;&#x95EE;&#x65C1;&#x8FB9;&#x7684;&#x54E5;&#x4EEC;&#x7B49;&#x4E86;&#x591A;&#x4E45;&#xFF0C;&#x4ED6;&#x8BF4;&#x4ED6;&#x7B49;&#x4E86;&#x4E94;&#x5206;&#x949F;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x4ECA;&#x5929;&#x529E;&#x7406;&#x4E1A;&#x52A1;&#x7684;&#x901F;&#x5EA6;&#x6BD4;&#x8F83;&#x5FEB;&#xFF0C;&#x90FD;&#x529E;&#x4E86;10&#x4E2A;&#x4EBA;&#x4E86;&#xFF0C;&#x521A;&#x8BF4;&#x7740;&#x5C31;&#x8F6E;&#x5230;&#x4ED6;&#x4E86;&#x3002;&#x5C0F;&#x660E;&#x770B;&#x4E86;&#x4E0B;&#x987F;&#x65F6;&#x8C03;&#x6574;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#xFF0C;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5728;&#x591A;&#x7B49;&#x4E0B;&#x80AF;&#x5B9A;&#x80FD;&#x591F;&#x529E;&#x7406;&#x4E1A;&#x52A1;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x5C0F;&#x660E;&#x5C31;&#x7B49;&#x5440;&#x7B49;&#xFF0C;&#x60F3;&#x4E0D;&#x5230;&#x524D;&#x9762;&#x90A3;&#x4E2A;&#x54E5;&#x4EEC;&#x4E0D;&#x5230;&#x4E00;&#x5206;&#x949F;&#x5C31;&#x5B8C;&#x4E8B;&#x513F;&#x4E86;&#xFF0C;&#x5C31;&#x8F6E;&#x5230;&#x5C0F;&#x660E;&#x529E;&#x7406;&#x4E1A;&#x52A1;&#x4E86;&#xFF0C;&#x4ECA;&#x5929;&#x603B;&#x7B97;&#x6CA1;&#x6709;&#x767D;&#x8DD1;&#x4E00;&#x8D9F;&#x3002;</p>
<p>&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#x7684;&#x65F6;&#x5019;&#x662F;&#x9700;&#x8981;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x652F;&#x6301;&#xFF0C;&#x4ECE;&#x7528;&#x6237;&#x6001;&#x5207;&#x6362;&#x5230;&#x6838;&#x5FC3;&#x6001;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x7ED9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5E76;&#x53D1;&#x6027;&#x80FD;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x538B;&#x529B;(&#x5C0F;&#x660E;&#x8DD1;&#x8DEF;&#x5F88;&#x7D2F;)&#x3002;&#x800C;&#x4E14;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x7684;&#x9501;&#x5B9A;&#x72B6;&#x6001;&#x53EA;&#x4F1A;&#x6301;&#x7EED;&#x5F88;&#x77ED;&#x7684;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4E3A;&#x4E86;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x53BB;&#x6302;&#x8D77;&#x548C;&#x56DE;&#x590D;&#x7EBF;&#x7A0B;&#x5E76;&#x4E0D;&#x503C;&#x5F97;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C31;&#x8BA9;&#x8BF7;&#x6C42;&#x9501;&#x7684;&#x90A3;&#x4E2A;&#x7EBF;&#x7A0B;&#x7B49;&#x4E00;&#x4E0B;&#x4E0D;&#x8981;&#x653E;&#x5F03;&#x5904;&#x7406;&#x5668;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x5FD9;&#x5FAA;&#x73AF;(&#x81EA;&#x65CB;,&#x76F8;&#x5F53;&#x4E8E;&#x5C0F;&#x660E;&#x5728;&#x4E1A;&#x52A1;&#x5927;&#x5385;&#x767E;&#x65E0;&#x804A;&#x8D56;&#x7684;&#x73A9;&#x624B;&#x673A;,&#x76EF;&#x7740;&#x4E1A;&#x52A1;&#x529E;&#x7406;&#x60C5;&#x51B5;)&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x7B49;&#x4E45;&#x4E86;&#x5440;&#xFF0C;&#x7B49;&#x4E45;&#x4E86;&#x4E5F;&#x662F;&#x5F88;&#x8017;&#x8D39;&#x5904;&#x7406;&#x5668;&#x8D44;&#x6E90;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x7ED9;&#x81EA;&#x5DF1;&#x8BBE;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x81EA;&#x65CB;&#x7684;&#x6B21;&#x6570;10&#x6B21;(&#x9ED8;&#x8BA4;)&#xFF0C;&#x5982;&#x679C;&#x64CD;&#x4F5C;&#x4E86;&#x8FD9;&#x4E2A;&#x6B21;&#x6570;&#x5C31;&#x6302;&#x8D77;&#x4E86;&#x3002;</p>
<p>&#x540E;&#x6765;JDK6&#x4E2D;&#x5F15;&#x5165;&#x4E86;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x81EA;&#x65CB;&#x8BF4;&#xFF0C;&#x5B83;&#x4F1A;&#x7531;&#x524D;&#x4E00;&#x6B21;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x9501;&#x4E0A;&#x7684;&#x81EA;&#x65CB;&#x65F6;&#x95F4;&#x4EE5;&#x53CA;&#x9501;&#x7684;&#x62E5;&#x6709;&#x8005;&#x72B6;&#x6001;&#x6765;&#x51B3;&#x5B9A;&#xFF0C;&#x5982;&#x679C;&#x540C;&#x4E00;&#x4E2A;&#x9501;&#x4E0A;&#x81EA;&#x65CB;&#x521A;&#x83B7;&#x5F97;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8BA4;&#x4E3A;&#x8FD9;&#x6B21;&#x4E5F;&#x6709;&#x5F88;&#x5927;&#x51E0;&#x7387;&#x83B7;&#x53D6;&#x5230;&#xFF0C;&#x5C31;&#x591A;&#x81EA;&#x65CB;&#x51E0;&#x6B21;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E2A;&#x9501;&#x8BF4;&#xFF0C;&#x81EA;&#x65CB;&#x5F88;&#x5C11;&#x83B7;&#x53D6;&#x5230;&#xFF0C;&#x5C31;&#x8BA4;&#x4E3A;&#x6CA1;&#x620F;&#xFF0C;&#x5C31;&#x4E0D;&#x81EA;&#x65CB;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x53BB;&#x6302;&#x8D77;&#x4E86;&#x3002;</p>
<h4 id="&#x9501;&#x7684;&#x6D88;&#x9664;">&#x9501;&#x7684;&#x6D88;&#x9664;</h4>
<h4 id="&#x9501;&#x7684;&#x7C97;&#x5316;">&#x9501;&#x7684;&#x7C97;&#x5316;</h4>
<h4 id="&#x504F;&#x5411;&#x9501;">&#x504F;&#x5411;&#x9501;</h4>
<h4 id="&#x8F7B;&#x91CF;&#x7EA7;&#x9501;">&#x8F7B;&#x91CF;&#x7EA7;&#x9501;</h4>
<h4 id="&#x91CD;&#x91CF;&#x7EA7;&#x9501;">&#x91CD;&#x91CF;&#x7EA7;&#x9501;</h4>
</span>
      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/多线程/" rel="tag">#多线程</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-prev post-nav-item">
            
              <a href="/2018/07/24/something-about-synchronized/" rel="prev">something-about-synchronized</a>
            
          </div>

          <div class="post-nav-next post-nav-item">
            
              <a href="/2018/07/16/how-to-use-methods-about-thread/" rel="next">关于wait,notify,join,sleep的用法说明</a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <div class="ds-share flat" data-thread-key="2018/07/19/lock-optimization-about-java/"
     data-title="java中锁的优化"
     data-content=""
     data-url="http://yoursite.com/2018/07/19/lock-optimization-about-java/">
  <div class="ds-share-inline">
    <ul  class="ds-share-icons-16">

      <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
      <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
      <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
      <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
      <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>

    </ul>
    <div class="ds-share-icons-more">
    </div>
  </div>
</div>
      
    </div>
  </div>

 </div>

        

        
          <div class="comments" id="comments">
            
              <div class="ds-thread" data-thread-key="2018/07/19/lock-optimization-about-java/"
                   data-title="java中锁的优化" data-url="http://yoursite.com/2018/07/19/lock-optimization-about-java/">
              </div>
            
          </div>
        
      </div>

      
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" src="http://7xlvme.com1.z0.glb.clouddn.com/avatar.jpg" alt="generalthink" itemprop="image"/>
          <p class="site-author-name" itemprop="name">generalthink</p>
        </div>
        <p class="site-description motion-element" itemprop="description">相信自己做一个自信的人</p>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">21</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          <div class="site-state-item site-state-categories">
            <a href="/categories">
              <span class="site-state-item-count">9</span>
              <span class="site-state-item-name">分类</span>
              </a>
          </div>

          <div class="site-state-item site-state-tags">
            <a href="/tags">
              <span class="site-state-item-count">13</span>
              <span class="site-state-item-name">标签</span>
              </a>
          </div>

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="menu-item-icon icon-next-feed"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/generalthink" target="_blank">github</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/think123" target="_blank">zhihu</a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">友情链接</p>
            
              <span class="links-of-author-item">
              <a href="http://www.baidu.com" target="_blank">baidu</a>
              </span>
            
              <span class="links-of-author-item">
              <a href="http://www.it2048.cn" target="_blank">it2048</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator"></div>
          <div class="post-toc">
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-3"><a class="nav-link" href="#锁的优化"><span class="nav-text">锁的优化</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#自旋锁以及自适应自旋"><span class="nav-text">自旋锁以及自适应自旋</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#锁的消除"><span class="nav-text">锁的消除</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#锁的粗化"><span class="nav-text">锁的粗化</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#偏向锁"><span class="nav-text">偏向锁</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#轻量级锁"><span class="nav-text">轻量级锁</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#重量级锁"><span class="nav-text">重量级锁</span></a></li></ol></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator"></div>
        </section>
      

    </div>
  </aside>


    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner"> <div class="powered-by">
  <a href="http://www.miitbeian.gov.cn/">蜀ICP备16009462号</a>
</div>


<div class="theme-info">

  Copyright &copy; &nbsp;  2014 - 
  <span itemprop="copyrightYear">2018</span>
  <span class="author" itemprop="copyrightHolder">generalthink.All rights reserved.</span>
</div>


<div class="copyright" >
  
</div>


 </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  
  
    

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"generalthink"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>
    
     

    
  
  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>
  <script type="text/javascript" src="/js/fancy-box.js?v=0.4.5.1"></script>


  <script type="text/javascript" src="/js/helpers.js?v=0.4.5.1"></script>
  

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/js/motion_global.js?v=0.4.5.1" id="motion.global"></script>




  <script type="text/javascript" src="/js/nav-toggle.js?v=0.4.5.1"></script>
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  
<script type="text/javascript" src="/js/bootstrap.scrollspy.js?v=0.4.5.1" id="bootstrap.scrollspy.custom"></script>


<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 0.4 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    var $tocContent = $('.post-toc-content');
    if (isDesktop() && CONFIG.sidebar === 'post') {
      if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
        displaySidebar();
      }
    }
  });
</script>



  <script type="text/javascript">
    $(document).ready(function () {
      if (CONFIG.sidebar === 'always') {
        displaySidebar();
      }
      if (isMobile()) {
        FastClick.attach(document.body);
      }
    });
  </script>

  

  
  

  
  <script type="text/javascript" src="/js/lazyload.js"></script>
  <script type="text/javascript">
    $(function () {
      $("#posts").find('img').lazyload({
        placeholder: "/images/loading.gif",
        effect: "fadeIn"
      });
    });
  </script>
</body>
</html>
